{
  "architectures": [
    "DiffusionGemmaForBlockDiffusion"
  ],
  "boi_token_id": 255999,
  "canvas_length": 256,
  "dtype": "bfloat16",
  "eoi_token_id": 258882,
  "eos_token_id": [
    1,
    106
  ],
  "image_token_id": 258880,
  "initializer_range": 0.02,
  "model_type": "diffusion_gemma",
  "text_config": {
    "attention_bias": false,
    "attention_dropout": 0.0,
    "bos_token_id": 2,
    "dtype": "bfloat16",
    "eos_token_id": 1,
    "final_logit_softcapping": 30.0,
    "global_head_dim": 512,
    "head_dim": 256,
    "hidden_activation": "gelu_pytorch_tanh",
    "hidden_size": 2816,
    "initializer_range": 0.02,
    "intermediate_size": 2112,
    "layer_types": [
      "sliding_attention",
      "sliding_attention",
      "sliding_attention",
      "sliding_attention",
      "sliding_attention",
      "full_attention",
      "sliding_attention",
      "sliding_attention",
      "sliding_attention",
      "sliding_attention",
      "sliding_attention",
      "full_attention",
      "sliding_attention",
      "sliding_attention",
      "sliding_attention",
      "sliding_attention",
      "sliding_attention",
      "full_attention",
      "sliding_attention",
      "sliding_attention",
      "sliding_attention",
      "sliding_attention",
      "sliding_attention",
      "full_attention",
      "sliding_attention",
      "sliding_attention",
      "sliding_attention",
      "sliding_attention",
      "sliding_attention",
      "full_attention"
    ],
    "max_position_embeddings": 262144,
    "model_type": "diffusion_gemma_text",
    "moe_intermediate_size": 704,
    "num_attention_heads": 16,
    "num_experts": 128,
    "num_global_key_value_heads": 2,
    "num_hidden_layers": 30,
    "num_key_value_heads": 8,
    "pad_token_id": 0,
    "rms_norm_eps": 1e-06,
    "rope_parameters": {
      "full_attention": {
        "partial_rotary_factor": 0.25,
        "rope_theta": 1000000.0,
        "rope_type": "proportional"
      },
      "sliding_attention": {
        "rope_theta": 10000.0,
        "rope_type": "default"
      }
    },
    "sliding_window": 1024,
    "tie_word_embeddings": true,
    "top_k_experts": 8,
    "use_bidirectional_attention": "vision",
    "vocab_size": 262144
  },
  "tie_word_embeddings": true,
  "transformers_version": "5.8.0.dev0",
  "vision_config": {
    "_name_or_path": "",
    "architectures": null,
    "attention_bias": false,
    "attention_dropout": 0.0,
    "chunk_size_feed_forward": 0,
    "default_output_length": 280,
    "dtype": "bfloat16",
    "global_head_dim": 72,
    "head_dim": 72,
    "hidden_activation": "gelu_pytorch_tanh",
    "hidden_size": 1152,
    "id2label": {
      "0": "LABEL_0",
      "1": "LABEL_1"
    },
    "initializer_range": 0.02,
    "intermediate_size": 4304,
    "is_encoder_decoder": false,
    "label2id": {
      "LABEL_0": 0,
      "LABEL_1": 1
    },
    "max_position_embeddings": 131072,
    "model_type": "gemma4_vision",
    "num_attention_heads": 16,
    "num_hidden_layers": 27,
    "num_key_value_heads": 16,
    "output_attentions": false,
    "output_hidden_states": false,
    "patch_size": 16,
    "pooling_kernel_size": 3,
    "position_embedding_size": 10240,
    "problem_type": null,
    "return_dict": true,
    "rms_norm_eps": 1e-06,
    "rope_parameters": {
      "rope_theta": 100.0,
      "rope_type": "default"
    },
    "standardize": true,
    "use_clipped_linears": false
  },
  "vision_soft_tokens_per_image": 280
}
